[
  {
    "id": 1,
    "name": "somnath",
    "live": true,
    "streamInfo": {
      "channelId": "UCT1egsvA08YcdMLiEu1DTRg",
      "title": "Shree Somnath Temple, First"
    },
    "aartiTimings": [
      "07:00",
      "12:00",
      "19:00"
    ],
    "templeInfo": {
      "description": "The Somnath temple located in Prabhas Patan near Veraval in Saurashtra on the western coast of Gujarat, is believed to be the first among the twelve jyotirlinga shrines of Shiva. It is an important pilgrimage and tourist spot of Gujarat.Reconstructed several times in the past after repeated destruction by several Muslim invaders and Portuguese the present temple was reconstructed in Chaulukya style of Hindu temple architecture and completed in May 1951. The reconstruction was completed by Vallabhbhai Patel. The site of Somnath has been a pilgrimage site from ancient times on account of being a Triveni sangam (the confluence of three rivers — Kapila, Hiran and Sarasvati. SomaMoon god, is believed to have lost his lustre due to a curse, and he bathed in the Sarasvati River at this site to regain it. The result is the waxing and waning of the moon, no doubt an allusion to the waxing and waning of the tides at this sea shore location. The name of the town Prabhas, meaning lustre, as well as the alternative names Someshvar and Somnath (“The lord of the moon” or “the moon god”) arise from this tradition",
      "hi": "सोमनाथ मन्दिर भूमण्डल में दक्षिण एशिया स्थित भारतवर्ष के पश्चिमी छोर पर गुजरात नामक राज्य में स्थित, अत्यन्त प्राचीन व ऐतिहासिक शिव मन्दिर का नाम है। यह भारतीय इतिहास तथा हिन्दुओं के चुनिन्दा और महत्वपूर्ण मन्दिरों में से एक है। इसे आज भी भारत के 12 ज्योतिर्लिंगों में सर्वप्रथम ज्योतिर्लिंग के रूप में माना व जाना जाता है। गुजरात के सौराष्ट्र क्षेत्र के वेरावल बन्दरगाह में स्थित इस मन्दिर के बारे में कहा जाता है कि इसका निर्माण स्वयं चन्द्रदेव ने किया था, जिसका उल्लेख ऋग्वेद में स्पष्ट है। लोककथाओं के अनुसार यहीं श्रीकृष्ण ने देहत्याग किया था। इस कारण इस क्षेत्र का और भी महत्त्व बढ़ गया। यह मन्दिर हिन्दू धर्म के उत्थान-पतन के इतिहास का प्रतीक रहा है। अत्यन्त वैभवशाली होने के कारण इतिहास में कई बार यह मंदिर तोड़ा तथा पुनर्निर्मित किया गया। वर्तमान भवन के पुनर्निर्माण का आरम्भ भारत की स्वतन्त्रता के पश्चात् लौहपुरुष सरदार वल्लभ भाई पटेल ने करवाया और पहली दिसम्बर 1955 को भारत के राष्ट्रपति राजेन्द्र प्रसाद ने इसे राष्ट्र को समर्पित किया। सोमनाथ मन्दिर विश्व प्रसिद्ध धार्मिक व पर्यटन स्थल है। मन्दिर प्रांगण में रात साढ़े सात से साढ़े आठ बजे तक एक घण्टे का साउण्ड एण्ड लाइट शो चलता है, जिसमें सोमनाथ मन्दिर के इतिहास का बड़ा ही सुन्दर सचित्र वर्णन किया जाता है।",
      "officialWebsite": "https://somnath.org/",
      "image": "somnath.png"
    },
    "liveUrl": "https://www.youtube.com/embed/ucEVNNTsXE4"
  },
  {
    "id": 3,
    "name": "mahakaal",
    "live": true,
    "streamInfo": {
      "channelId": "UCEUuwXHmHckwmdANSy4c7Sw",
      "title": "Shri Mahakaleshwar Mandir Prabandha Samitee"
    },
    "aartiTimings": [
      "04:00",
      "07:00",
      "10:00",
      "17:00",
      "19:00",
      "22:30"
    ],
    "templeInfo": {
      "description": "Mahakaleshwar Jyotirlinga is a Hindu temple dedicated to Shiva and is one of the twelve Jyotirlingas, shrines which are said to be the most sacred abodes of Shiva. It is located in the ancient city of Ujjain in the state of Madhya Pradesh, India. The temple is situated on the side of the holy river Shipra. The presiding deity, Shiva in the lingam form is believed to be Swayambhu, deriving currents of power (Shakti) from within itself as against the other images and lingams that are ritually established and invested with mantra-shakti. Madhya Pradesh has two Jyotirlingas, the second one, Omkareshwar Jyotirlinga, is situated about 140 km south of Mahakaleshwar Jyotirlinga. The presiding deity of time, Shiva, in all his splendor, reigns eternally in the city of Ujjain. The temple of Mahakaleshwar, its shikhar soaring into the sky, an imposing façade against the skyline, evokes primordial awe and reverence with its majesty. The Mahakal dominates the life of the city and its people, even in the midst of the busy routine of modern preoccupations, and provides an unbreakable link with ancient Hindu traditions.",
      "hi": "महाकालेश्वर ज्योतिर्लिंग ( आईपीए: [महाकालेश्वर] ) शिव को समर्पित एक हिंदू मंदिर है और यह बारह ज्योतिर्लिंगों में से एक है , जिन्हें शिव का सबसे पवित्र निवास कहा जाता है। यह भारत के मध्य प्रदेश राज्य के प्राचीन शहर उज्जैन में स्थित है । यह मंदिर पवित्र शिप्रा नदी के किनारे स्थित है । माना जाता है कि लिंगम रूप में पीठासीन देवता शिव स्वयंभू हैं , जो अपने भीतर से शक्ति की धाराएँ ( शक्ति ) प्राप्त करते हैं, जबकि अन्य छवियाँ और लिंग अनुष्ठानपूर्वक स्थापित किए जाते हैं और मंत्र-शक्ति से युक्त होते हैं। महाकालेश्वर की मूर्ति दक्षिणामूर्ति मानी जाती है , जिसका अर्थ है कि वह दक्षिण की ओर मुख करके खड़ी है। [ 1 ] तांत्रिक शिवनेत्र परंपरा द्वारा कायम रखी गई यह एक अनूठी विशेषता है जो 12 ज्योतिर्लिंगों में से केवल महाकालेश्वर में ही पाई जाती है। ओंकारेश्वर महादेव की मूर्ति महाकाल मंदिर के ऊपर गर्भगृह में प्रतिष्ठित है। गर्भगृह के पश्चिम, उत्तर और पूर्व में गणेश , पार्वती और कार्तिकेय की छवियां स्थापित हैं। दक्षिण में शिव के वाहन नंदी की छवि है । तीसरी मंजिल पर नागचंद्रेश्वर की मूर्ति केवल नाग पंचमी के दिन दर्शन के लिए खुलती है । मंदिर के पाँच स्तर हैं, जिनमें से एक भूमिगत है। मंदिर स्वयं एक विशाल प्रांगण में स्थित है जो एक झील के पास विशाल दीवारों से घिरा है। शिखर या शिखर मूर्तिकला की सजावट से सुशोभित है ऐसा माना जाता है कि अन्य सभी मंदिरों के विपरीत यहाँ देवता को चढ़ाया गया प्रसाद (पवित्र प्रसाद) दोबारा भी चढ़ाया जा सकता है।",
      "officialWebsite": "https://shrimahakaleshwar.com/",
      "image": "mahakaleshwar.png"
    },
    "liveUrl": "https://www.youtube.com/embed/w1YcIUWnaxI"
  },
  {
    "id": 5,
    "name": "baidyanath",
    "live": true,
    "streamInfo": {
      "channelId": "UCgdw7vXazBgac1V3VSi_0sw",
      "title": "LIVE : Baba Baidyanath Dham Live Darshan"
    },
    "fallbackUrl": "",
    "aartiTimings": [
      "04:00",
      "15:30",
      "18:00"
    ],
    "templeInfo": {
      "description": "Baidyanath Temple also known as Baba Baidyanath Dham, is a Hindu temple dedicated to Shiva. It is located in Deoghar, in the Santhal Parganas division of the Indian state of Jharkhand.[1] The temple complex comprises the central shrine of Baba Baidyanath along with 21 additional temples. It is significant to the Hindu sects of Shaivism as this temple is referred to as one of the twelve Jyotirlingas. According to Shiv Mahapuran, once Brahma (the Hindu God of creation) and Vishnu (the Hindu God of preservation) had an argument in terms of supremacy of creation.[3] To test them, Shiva pierced the three worlds as a huge endless pillar of light, the jyotirlinga. Vishnu and Brahma split their ways to downwards and upwards respectively to find the end of the light in either direction. Brahma lied that he found out the end, while Vishnu conceded his defeat. Shiva appeared as the second pillar of light and cursed Brahma that he would have no place in ceremonies while Vishnu would be worshipped until the end of eternity. The jyotirlinga is the supreme partless reality, out of which Shiva partly appears. The jyothirlinga shrines, thus are places where Shiva appeared as a fiery column of light.",
      "hi": "वैद्यनाथ मन्दिर भारतवर्ष के झारखण्ड राज्य के देवघर नामक स्‍थान में अवस्थित एक प्रसिद्ध मंदिर है।[1][2] शिव का एक नाम 'बैद्यनाथ भी है, इस कारण लोग इसे 'वैद्यनाथ धाम' भी कहते हैं। यह एक सिद्धपीठ है। इस कारण इस लिंग को 'कामना लिंग' भी कहा जाता हैं। इस लिंग की स्थापना का इतिहास यह है कि एक बार असुरराज रावण ने हिमालय पर जाकर शिवजी की प्रसन्नता के लिये घोर तपस्या की और अपने सिर काट-काटकर शिवलिंग पर चढ़ाने शुरू कर दिये। एक-एक करके नौ सिर चढ़ाने के बाद दसवाँ सिर भी काटने को ही था कि शिवजी प्रसन्न होकर प्रकट हो गये। उन्होंने उसके दसों सिर ज्यों-के-त्यों कर दिये और उससे वरदान माँगने को कहा। रावण ने लंका में जाकर उस लिंग को स्थापित करने के लिये उसे ले जाने की आज्ञा माँगी। शिवजी ने अनुमति तो दे दी, पर इस चेतावनी के साथ दी कि यदि मार्ग में इसे पृथ्वी पर रख देगा तो वह वहीं अचल हो जाएगा। अन्ततोगत्वा वही हुआ। रावण शिवलिंग लेकर चला पर मार्ग में एक चिताभूमि आने पर उसे लघुशंका निवृत्ति की आवश्यकता हुई। रावण उस लिंग को एक व्यक्ति को थमा लघुशंका-निवृत्ति करने चला गया। इधर उन व्यक्ति ने ज्योतिर्लिंग को बहुत अधिक भारी अनुभव कर भूमि पर रख दिया। फिर क्या था, लौटने पर रावण पूरी शक्ति लगाकर भी उसे न उखाड़ सका और निराश होकर मूर्ति पर अपना अँगूठा गड़ाकर लंका को चला गया। इधर ब्रह्मा, विष्णु आदि देवताओं ने आकर उस शिवलिंग की पूजा की। शिवजी का दर्शन होते ही सभी देवी देवताओं ने शिवलिंग की वहीं उसी स्थान पर प्रतिस्थापना कर दी और शिव-स्तुति करते हुए वापस स्वर्ग को चले गये। जनश्रुति व लोक-मान्यता के अनुसार यह वैद्यनाथ-ज्योतिर्लिग मनोवांछित फल देने वाला है।",
      "officialWebsite": "https://babadham.org/",
      "image": "baidyanath.png"
    },
    "liveUrl": "https://www.youtube.com/embed/5pT34LR2m6g"
  },
  {
    "id": 2,
    "name": "mallikarjuna",
    "live": false,
    "liveUrl": "https://www.youtube.com/embed/rfppvswfMyc?start=11",
    "fallbackUrl": "",
    "aartiTimings": [
      "05:00",
      "05:30",
      "17:00"
    ],
    "templeInfo": {
      "description": "Sri Bhramarambika sametha Mallikarjuna swamy Devasthanam (romanised: Mallikārjunuḍu) or Srisailam Temple is a Hindu temple dedicated to the deities Shiva and Parvati, located at Srisailam in the Indian state of Andhra Pradesh. It is significant to the Hindu sects of both Shaivism and Shaktism as this temple is referred to as one of the twelve Jyotirlingas of Shiva and as one of the eighteen Shakti pithas, centres of the Hindu goddess.[1] Shiva is worshiped as Mallikarjuna and is represented by the lingam. His consort Parvati is depicted as Bhramaramba. Legend- When Shiva and Parvati decided to find suitable brides for their sons. Shiva got Buddhi (intellect) and Siddhi (spiritual power) married to Ganesha. Kartikeya on his return was enraged and went away to stay alone on Mount Krauncha in Palani in the name of Kumara brahmachari. On seeing his father coming over to pacify him, he tried to move to another place, but on the request of the Devas, stayed close by. The place where Shiva and Parvati stayed came to be known as Srisailam.[2] According to Hindu legend, the presiding deity in the form of Linga (an iconic form of Shiva) was worshipped with jasmine (locally called in Telugu as Mallika), leading to the name Mallikarjuna.[3]",
      "hi": "श्री भ्रमराम्बिका समीथा मल्लिकार्जुन स्वामी देवस्थानम ( रोमनकृत : मल्लिकार्जुनुडु) या श्रीशैलम मंदिर एक हिंदू मंदिर है जो भगवान शिव और पार्वती को समर्पित है , जो भारत के आंध्र प्रदेश राज्य के श्रीशैलम में स्थित है। यह शैव और शक्ति दोनों हिंदू संप्रदायों के लिए महत्वपूर्ण है क्योंकि इस मंदिर को शिव के बारह ज्योतिर्लिंगों में से एक और हिंदू देवी के अठारह शक्तिपीठों में से एक के रूप में जाना जाता है। [ 1 ] शिव की पूजा मल्लिकार्जुन के रूप में की जाती है और उन्हें लिंगम द्वारा दर्शाया जाता है । उनकी पत्नी पार्वती को भ्रमराम्बा के रूप में दर्शाया गया है। दंतकथा- जब शिव और पार्वती ने अपने पुत्रों के लिए उपयुक्त वर खोजने का फैसला किया। शिव ने बुद्धि (बुद्धि) और सिद्धि (आध्यात्मिक शक्ति) का विवाह गणेश से करवाया । कार्तिकेय वापस लौटने पर क्रोधित हो गए और कुमार ब्रह्मचारी के नाम से पलानी में क्रौंच पर्वत पर अकेले रहने चले गए । अपने पिता को शांत करने के लिए आते देख उन्होंने दूसरी जगह जाने की कोशिश की, लेकिन देवताओं के अनुरोध पर वे पास ही रुक गए। जिस स्थान पर शिव और पार्वती रुके थे, उसे श्रीशैलम के नाम से जाना जाता है।",
      "officialWebsite": "https://www.srisailadevasthanam.org/en-in/home",
      "image": "mallikarnuja.png"
    }
  },
  {
    "id": 9,
    "name": "kashi",
    "live": true,
    "streamInfo": {
      "channelId": "UCQBHzUTNjllZ6oGP7VJswDA",
      "title": "श्री काशी विश्वनाथ धाम"
    },
    "aartiTimings": [
      "03:00",
      "11:00",
      "19:00",
      "21:00",
      "22:30"
    ],
    "templeInfo": {
      "description": "Kashi Vishwanath Temple is a Hindu temple dedicated to Shiva. It is located in Vishwanath Gali, in Varanasi, Uttar Pradesh, India. The temple is a Hindu pilgrimage site and is one of the twelve Jyotirlinga shrines. It is believed that Varanasi is the first Jyotirlinga to manifest itself.[8] According to the legend, it was at this place that Shiva (the Hindu god of destruction) manifested as an infinite column of light (Jyotirlinga) in front of Brahma (the Hindu god of creation) and Vishnu (the Hindu god of preservation) when they had an argument about their supremacy. In order to discover the origin of the luminous column, Vishnu took the form of a boar (Varaha) and tracked the column beneath the ground, while Brahma, who assumed the shape of a swan, scoured the heavens in an attempt to locate the apex of the column. However, both of them were unsuccessful in identifying the source of the luminous column. Yet, Brahma deceitfully asserted that he had discovered the summit of the column, while Vishnu humbly admitted his inability to find the starting point of the radiant column. Due to Brahma's deceit over the discovery of the origin of the luminous column, Shiva penalised him by cutting his fifth head and placing a curse upon him. This curse entailed that Brahma would no longer receive reverence, whereas Vishnu, being truthful, would be equally venerated alongside Shiva and have dedicated temples for eternity. Hindu scriptures describe Vishweshwara as the sacred deity of Varanasi, holding the position of king over all the other deities as well as over all the inhabitants of the city and the extended circuit of the Panchkoshi, an area (the sacred boundary of Varanasi) spreading over 50 miles.",
      "hi": "काशी विश्वनाथ मंदिर भगवान शिव को समर्पित एक प्रसिद्ध हिंदू मंदिर है। यह भारत के उत्तर प्रदेश के प्राचीन शहर बनारस के विश्वनाथ गली में स्थित है। यह हिंदुओं के सबसे पवित्र तीर्थ स्थलों में से एक है और भगवान शिव के बारह ज्योतिर्लिंग मंदिरों में से एक है। यह मंदिर पिछले कई हजारों सालों से पवित्र गंगा नदी के पश्चिमी तट पर स्थित है। हिन्दू धर्म में कहते हैं कि प्रलयकाल में भी इसका लोप नहीं होता। उस समय भगवान शंकर इसे अपने त्रिशूल पर धारण कर लेते हैं और सृष्टि काल आने पर इसे नीचे उतार देते हैं। यही नहीं, आदि सृष्टि स्थली भी यहीं भूमि बतलायी जाती है। इसी स्थान पर भगवान विष्णु ने सृष्टि उत्पन्न करने की कामना से तपस्या करके आशुतोष को प्रसन्न किया था और फिर उनके शयन करने पर उनके नाभि-कमल से ब्रह्मा उत्पन्न हुए, जिन्होने सारे संसार की रचना की। अगस्त्य मुनि ने भी विश्वेश्वर की बड़ी आराधना की थी और इन्हीं की अर्चना से श्रीवशिष्ठजी तीनों लोकों में पुजित हुए तथा राजर्षि विश्वामित्र ब्रह्मर्षि कहलाये।",
      "officialWebsite": "https://www.shrikashivishwanath.org",
      "image": "kashi.png"
    },
    "liveUrl": "https://www.youtube.com/embed/8pSi0xZm6ak"
  },
  {
    "id": 13,
    "name": "siddhivinayak",
    "live": true,
    "streamInfo": {
      "channelId": "UCF9FdiMBENIbM6jb44zWmCQ",
      "title": "Shree Siddhivinayak Ganapati Temple Trust Live Stream"
    },
    "aartiTimings": [
      "05:30",
      "12:15",
      "19:30",
      "21:50"
    ],
    "templeInfo": {
      "description": "The Shri Siddhivinayak Ganapati Mandir is a Hindu temple dedicated to Ganesha. It is located in Prabhadevi neighbourhood of Mumbai, Maharashtra, India.[1] It was originally built by Laxman Vithu and Deubai Patil on 19 November 1801. It is one of the most popular Hindu temples in Mumbai. The temple has a small mandap with the shrine for Siddhi Vinayak ('Ganesha who grants your wish'). The wooden doors to the sanctum are carved with images of the Ashtavinayak (the eight manifestations of Ganesha in Maharashtra). The inner roof of the sanctum is plated with gold, and the central statue is of Ganesha. In the periphery, there is a Hanuman temple as well. The exterior of the temple consists of a dome which is lit up with multiple colors in the evenings and they keep changing every few hours. The statue of Shri Ganesha is located exactly under the dome. The pillars are carved out with the images of ashtvinayak.",
      "hi": "सिद्धिविनायक मन्दिर मुम्बई स्थित एक प्रसिद्ध गणेशमन्दिर है। सिद्घिविनायक, गणेश जी का सबसे लोकप्रिय रूप है। गणेश जी जिन प्रतिमाओं की सूड़ दाईं तरह मुड़ी होती है, वे सिद्घपीठ से जुड़ी होती हैं और उनके मंदिर सिद्घिविनायक मंदिर कहलाते हैं। कहते हैं कि सिद्धि विनायक की महिमा अपरंपार है, वे भक्तों की मनोकामना को तुरन्त पूरा करते हैं। मान्यता है कि ऐसे गणपति बहुत ही जल्दी प्रसन्न होते हैं और उतनी ही जल्दी कुपित भी होते हैं।यह हिंदू धर्म का एक प्रमुख तीर्थस्थल है। सिद्धि विनायक की दूसरी विशेषता यह है कि वह चतुर्भुजी विग्रह है। उनके ऊपरी दाएं हाथ में कमल और बाएं हाथ में अंकुश है और नीचे के दाहिने हाथ में मोतियों की माला और बाएं हाथ में मोदक (लड्डुओं) भरा कटोरा है। गणपति के दोनों ओर उनकी दोनो पत्नियां ऋद्धि और सिद्धि मौजूद हैं जो धन, ऐश्वर्य, सफलता और सभी मनोकामनाओं को पूर्ण करने का प्रतीक है। मस्तक पर अपने पिता शिव के समान एक तीसरा नेत्र और गले में एक सर्प हार के स्थान पर लिपटा है। सिद्धि विनायक का विग्रह ढाई फीट ऊंचा होता है और यह दो फीट चौड़े एक ही काले शिलाखंड से बना होता है। किंवदन्दि है कि इस मंदिर का निर्माण संवत् १६९२ में हुआ था। मगर सरकारी दस्तावेजों के मुताबिक इस मंदिर का १९ नवंबर १८०१ में पहली बार निर्माण हुआ था। सिद्धि विनायक का यह पहला मंदिर बहुत छोटा था। पिछले दो दशकों में इस मंदिर का कई बार पुनर्निर्माण हो चुका है। हाल ही में एक दशक पहले १९९१ में महाराष्ट्र सरकार ने इस मंदिर के भव्य निर्माण के लिए २० हजार वर्गफीट की जमीन प्रदान की। वर्तमान में सिद्धि विनायक मंदिर की इमारत पांच मंजिला है और यहां प्रवचन ग्रह, गणेश संग्रहालय व गणेश विापीठ के अलावा दूसरी मंजिल पर अस्पताल भी है, जहां रोगियों की मुफ्त चिकित्सा की जाती है। इसी मंजिल पर रसोईघर है, जहां से एक लिफ्ट सीधे गर्भग्रह में आती है। पुजारी गणपति के लिए निर्मित प्रसाद व लड्डू इसी रास्ते से लाते हैं। नवनिर्मित मंदिर के 'गभारा ’ यानी गर्भगृह को इस तरह बनाया गया है ताकि अधिक से अधिक भक्त गणपति का सभामंडप से सीधे दर्शन कर सकें। पहले मंजिल की गैलरियां भी इस तरह बनाई गई हैं कि भक्त वहां से भी सीधे दर्शन कर सकते हैं। अष्टभुजी गर्भग्रह तकरीबन १० फीट चौड़ा और १३ फीट ऊंचा है। गर्भग्रह के चबूतरे पर स्वर्ण शिखर वाला चांदी का सुंदर मंडप है, जिसमें सिद्धि विनायक विराजते हैं। गर्भग्रह में भक्तों के जाने के लिए तीन दरवाजे हैं, जिन पर अष्टविनायक, अष्टलक्ष्मी और दशावतार की आकृतियां चित्रित हैं। वैसे भी सिद्धिविनायक मंदिर में हर मंगलवार को भारी संख्या में भक्तगण गणपति बप्पा के दर्शन कर अपनी अभिलाषा पूरी करते हैं। मंगलवार को यहां इतनी भीड़ होती है कि लाइन में चार-पांच घंटे खड़े होने के बाद दर्शन हो पाते हैं। हर साल गणपति पूजा महोत्सव यहां भाद्रपद की चतुर्थी से अनंत चतुर्दशी तक विशेष समारोह पूर्वक मनाया जाता है।",
      "officialWebsite": "https://www.siddhivinayak.org/",
      "image": "siddhivinayak.png"
    },
    "liveUrl": "https://www.youtube.com/embed/PSSE3vQAJz0"
  },
  {
    "id": 15,
    "name": "khajrana",
    "live": true,
    "streamInfo": {
      "channelId": "UCKulZy7GUcfLE8ZaYi5V_kg",
      "title": "Khajrana Ganesh Mandir Live Darsha Live Stream"
    },
    "aartiTimings": [
      "05:30",
      "08:00",
      "20:00"
    ],
    "templeInfo": {
      "description": "Citizens of Indore city and other nearby cities have great faith in the Khajrana temple. This temple was made by Ahilyabai Holkar, the brave Maratha queen. This is an important place of Hindus. Khajrana Ganesha Temple was constructed by Rani Ahilyabai Holkar. This temple is one of the famous Hindu temples in India. Mostly wednesday and sunday huge people will come to this temple for offering prayers. As per a local belief, all the wishes of the devotees are fulfilled, once they worship in this temple. The main festival of this temple is vinayak chathurthi and was held in grand manner in the month of August and september,The temple is taken over by the government. The temple is managed by the Bhatt family. It is believed that in order to safe guard the idol from Aurangzeb, the idol was hidden in a well and in 1735, it was taken out from the well and a temple was established in 1735 by Ahilyabai Holkar belonging to the Holkar dynasty of the Maratha Empire. The temple has developed a lot over the years. It has developed from a small hut to a huge temple and the most revered shrine in the city. There are regular donation of gold, diamonds and other precious jewels at the temple.The gate and the outer wall of the Garbhagriha is made of silver and different moods and festivals are depicted on it. The eyes of the deity are made of diamonds which were donated by a business man of Indore. The upper wall of the Garbhagriha is made of silver.",
      "hi": "इंदौर शहर और आस-पास के अन्य शहरों के नागरिकों की खजराना मंदिर में बहुत आस्था है। इस मंदिर का निर्माण वीर मराठा रानी अहिल्याबाई होल्कर ने करवाया था। यह हिंदुओं का एक महत्वपूर्ण स्थान है। खजराना गणेश मंदिर का निर्माण रानी अहिल्याबाई होल्कर ने करवाया था। यह मंदिर भारत के प्रसिद्ध हिंदू मंदिरों में से एक है। इस मंदिर में बुधवार और रविवार को बड़ी संख्या में लोग पूजा-अर्चना के लिए आते हैं। स्थानीय मान्यता के अनुसार, इस मंदिर में पूजा करने के बाद भक्तों की सभी मनोकामनाएं पूरी होती हैं। इस मंदिर का मुख्य उत्सव विनायक चतुर्थी है और अगस्त और सितंबर के महीने में इसे बड़े पैमाने पर मनाया जाता है। मंदिर का प्रबंधन भट्ट परिवार द्वारा किया जाता है। ऐसा माना जाता है कि औरंगजेब से मूर्ति की सुरक्षा के लिए मूर्ति को एक कुएं में छिपा दिया गया था और 1735 में इसे कुएं से बाहर निकाला गया और 1735 में मराठा साम्राज्य के होलकर वंश से संबंधित अहिल्याबाई होलकर द्वारा एक मंदिर की स्थापना की गई। मंदिर का विकास पिछले कुछ सालों में बहुत हुआ है। यह एक छोटी सी झोपड़ी से एक विशाल मंदिर और शहर का सबसे पूजनीय तीर्थस्थल बन गया है। मंदिर में नियमित रूप से सोने, हीरे और अन्य कीमती रत्नों का दान किया जाता है। गर्भगृह का द्वार और बाहरी दीवार चांदी से बनी है और इस पर अलग-अलग मूड और त्यौहार दर्शाए गए हैं। देवता की आंखें हीरे से बनी हैं जो इंदौर के एक व्यवसायी ने दान की थीं। गर्भगृह की ऊपरी दीवार चांदी से बनी है।",
      "officialWebsite": "https://shreeganeshkhajrana.com/",
      "image": "khajrana.png"
    },
    "liveUrl": "https://www.youtube.com/embed/fxoCwnroOno"
  },
  {
    "id": 16,
    "name": "matavaishnodevi",
    "live": true,
    "streamInfo": {
      "channelId": "UCziZy6xAlJWPzgIY4duxAeQ",
      "title": "Live: Maa Vaishno Devi Aarti From Bhawan"
    },
    "aartiTimings": [
      "06:20",
      "07:20"
    ],
    "templeInfo": {
      "description": "Vaishno Devi Temple, also known as the Shri Mata Vaishno Devi Temple and Vaishno Devi Bhavan, is a Hindu temple located in Katra, Jammu and Kashmir, dedicated to Vaishno Devi, a manifestation of Mahakali, Mahalakshmi, and Mahasarasvati. It is located on the Trikuta mountain at 5,000 feet / 1,500 meters elevation. The Shakti tradition considers it to be a Shakti Pitha. The temple is governed by the Shri Mata Vaishno Devi Shrine Board (SMVDSB) and has been chaired by the Governor of Jammu and Kashmir since August 1986. The three icons — Mahakali, Mahalakshmi and Mahasaraswati, all images of Vaishno Devi are worshipped at the temple. The feet of the icons are washed by the water brought from the perennial flowing river Banganga. It is said that Bhairon Nath, a famous Hindu Tantric, saw the young Vaishno Devi at an agricultural fair and fell madly in lusty love with her. Vaishno Devi fled into Trikuta hills to escape his amorous advances, later she turned into her original form of Durga and cut off his head with her sword in a cave.",
      "hi": "वैष्णो देवी मंदिर को श्री माता वैष्णो देवी मंदिर भी कहा जाता है और वैष्णो देवी भवन देवी वैष्णो देवी को समर्पित एक प्रमुख और व्यापक रूप से सम्मानित हिंदू मंदिर है। यह भारत में जम्मू और कश्मीर के केंद्र शासित प्रदेश के भीतर त्रिकुटा पहाड़ियों की ढलान पर कटरा, रियासी में स्थित है। मंदिर को दुर्गा को समर्पित 108 महा (प्रमुख) शक्ति पीठों में से एक के रूप में मान्यता प्राप्त है, जिन्हें वैष्णो देवी के रूप में पूजा जाता है। दुर्गा के प्रमुख पहलू होने के कारण, हिंदू वैष्णो देवी को काली, सरस्वती और लक्ष्मी का अवतार मानते हैं। मंदिर श्री माता वैष्णो देवी श्राइन बोर्ड (एसएमवीडीएसबी) द्वारा शासित है, जिसकी अध्यक्षता अगस्त 1986 में जम्मू और कश्मीर सरकार ने की थी| मंदिर में वैष्णो देवी की तीन मूर्तियों  — महाकाली, महालक्ष्मी और महासरस्वती की पूजा की जाती है। मूर्तियों के चरण बारहमासी बहने वाली बाणगंगा से लाए गए पानी से धोए जाते हैं। ऐसा कहा जाता है कि एक प्रसिद्ध हिंदू तांत्रिक भैरों नाथ ने युवा वैष्णो देवी को एक कृषि मेले में देखा और उसके प्यार में पागल हो गए। वैष्णो देवी अपने कामुक अग्रिमों से बचने के लिए त्रिकुटा पहाड़ियों में भाग गईं, बाद में उन्होंने दुर्गा का रूप धारण किया और एक गुफा में अपनी तलवार से उनका सिर काट दिया। लेखक मनोहर सजनानी के अनुसार, हिंदू पौराणिक कथाओं का मानना है कि वैष्णो देवी का मूल निवास अर्ध कुंवारी था, जो कटरा शहर और गुफा के बीच लगभग आधे रास्ते में था। ",
      "officialWebsite": "https://maavaishnodevi.org/",
      "image": "matavaishnodevi.png"
    },
    "liveUrl": "https://www.youtube.com/embed/wn0zteVFr-8"
  },
  {
    "id": 17,
    "name": "sanwaliaji",
    "live": true,
    "streamInfo": {
      "channelId": "UCgktEvceTyKnDN3w4F8n9Xg",
      "title": "Live Darshan For Shri Sanwaliya seth"
    },
    "aartiTimings": [
      "05:30",
      "10:00",
      "02:30",
      "20:00",
      "21:15"
    ],
    "templeInfo": {
      "description": "Sanwaliaji Temple is a Hindu temple dedicated to Krishna on the Chittorgarh–Udaipur Highway, Rajasthan, India. In Mewar, that in the year 1840, a cowherd named Bholaram dreamed of burying three divine idols underground at Chhapar in Bagund village; upon excavating the site, three beautiful idols of Krishna were discovered, as depicted in the dream. One of the statues was taken to Mandaphiya, one to Bhadsoda and the third remained at Chapar, at the very place where it was found.[1] All three locations became temples. These three temples are located close to each other, within the 5 km distance. The three temples of Sanwaliya Ji became renowned and devotees visit them in large numbers since then. Among these three temples, Mandaphia Temple is recognized as the Sanwalia Ji Dham (abode of Sanwaliya). According to a legend, these idols were made by Naga monks, which were hidden in the ground for fear of the invaders. Near this place is Bhadasoda village which has a history of more than 1000 years. Pritha, the sister of Veer Prithviraja Chauhan, the ruler of Ajmer and Delhi, was married to Rana Samar Singh of Chittor. After marriage, the slaves and the Charan chieftain who came to Chittor with Prtiha were given 12 villages in Jagir by Rana Samar Singh. These villages also included Bhadasoda village, Puraji Bhagat, the very famous householder saint of the Suthar caste, lived in Bhadasoda. Under his direction, these idols were handled and kept safe. An idol was taken to Bhadasoda village, where a temple was constructed by Shaktawat Rajput ruler of Bhinder Thikana by instruction of Bhagatji and , the temple of Samwalia ji Was built. The second idol was taken to the village of Mandafia, a temple was constructed there too, which became famous with time. Even today, thousands of travelers from far and wide come to visit every year.",
      "hi": "सांवरिया जी मंदिर राजस्थान के चित्तौड़गढ़ जिले में स्थित है। यह श्री सांवलिया सेठ के नाम से भी जाना जाता है। किंवदंती यह है कि वर्ष 1840 में, भोलाराम गुर्जर नाम के एक ग्वाला ने बागुंड गाँव के छापर में तीन दिव्य मूर्तियों को भूमिगत दफनाने का सपना देखा था; साइट को खोदने पर, भगवान कृष्ण की तीन सुंदर मूर्तियों की खोज की गई, जैसा कि सपने में दिखाया गया था। मूर्तियों में से एक को मंडफिया ले जाया गया, एक को भादसोड़ा और तीसरा बागुंड गाँव के छापर में, उसी स्थान पर जहां यह पाया गया था। तीनों स्थान मंदिर बन गए। ये तीनों मंदिर 5 किमी की दूरी के भीतर एक-दूसरे के करीब स्थित हैं। सांवलिया जी के तीन मंदिर प्रसिद्ध हुए और तब से बड़ी संख्या में भक्त उनके दर्शन करने आते हैं। इन तीन मंदिरों में मंडफिया मंदिर को सांवलिया जी धाम (सांवलिया का निवास) के रूप में मान्यता प्राप्त है। यहाँ राजस्थान,मध्य प्रदेश,गुजरात से सबसे ज्यादा श्रद्धालु आते है। चित्तौड़गढ़ रेलवे स्टेशन से 41किमी. व डबोक एयरपोर्ट से 65 किमी. पर स्थित मंडपिया अब श्री सांवलिया धाम (भगवान कृष्ण का निवास) के रूप में जाना जाता है और वैष्णव संप्रदाय के अनुयायियों के लिए श्री नाथद्वारा के बाद दूसरे स्थान पर है।",
      "officialWebsite": "https://shrisanwariyaseth.org/",
      "image": "sanwaliyaji.png"
    },
    "liveUrl": "https://www.youtube.com/embed/4F67mY_M6XQ"
  },
  {
    "id": 18,
    "name": "dwarkadhish",
    "live": true,
    "streamInfo": {
      "channelId": "UCBAvMHZO3BIfMMhOK9LMOYQ",
      "title": "Shree Dwarkadhish Temple Dwarka"
    },
    "aartiTimings": [
      "06:30",
      "10:30",
      "19:30",
      "20:30"
    ],
    "templeInfo": {
      "description": "The Dwarkadhish temple, also known as the Jagat Mandir and occasionally spelled Dwarakadheesh, is a Hindu temple dedicated to Krishna, who is worshiped here by the name Dwarkadhish or 'King of Dwarka'. The temple is located at Dwarka city of Gujarat, India, which is one of the destinations of Char Dham,As per Hindu legend, Dwarka was built on a piece of land by Krishna that was reclaimed from the sea. According to the Mahabharata, the sage Durvasa once visited Krishna and his wife Rukmini. The sage wished that the pair took him to their palace, demanding that they pull his chariot like horses. The pair agreed and started to carry the sage, even as the latter struck Rukmini when she fell.After some distance, according to local tradition, Rukmini got tired and she requested some water from Krishna. Krishna dug a hole with his powers that brought in river Ganga to the place. Durvasa was furious and cursed Rukmini to remain in the place. The temple where Rukmini's shrine is found, is believed to be the place where she stood.In the epic, finding no fault with the divine couple, Durvasa blessed Krishna with invincibility everywhere except the soles of his feet, and declared that Rukmini would be the foremost of the deity's spouses and would be his eternal companion in the next world as well. ",
      "hi": "द्वारिकाधीश मंदिर, भी जगत मंदिर के रूप मे जाना जाता है। यह हिंदू मंदिर भगवान श्री विष्णु के आठवे अवतार भगवान श्री कृष्णा को समर्पित है। मंदिर भारत के गुजरात के द्वारका में स्थित है। हिंदू कथा के अनुसार, द्वारका का निर्माण कृष्ण द्वारा भूमि के एक टुकड़े पर किया गया था जो समुद्र से प्राप्त हुआ था। ऋषि दुर्वासा एक बार कृष्ण और उनकी पत्नी रुक्मिणी से मिलने गए । ऋषि की इच्छा थी कि जोड़ा उन्हें अपने महल में ले जाए। यह जोड़ा आसानी से सहमत हो गया और ऋषि के साथ उनके महल में जाने लगा। कुछ दूर जाने के बाद रुक्मिणी थक गईं और उन्होंने कृष्ण से कुछ पानी मांगा। कृष्णा ने एक पौराणिक छेद खोदा जो गंगा नदी में लाया गया था। ऋषि दुर्वासा उग्र हो गए और रुक्मिणी को जगह में रहने के लिए शाप दिया। जिस मंदिर में रुक्मिणी का मंदिर पाया जाता है, माना जाता है कि वह जिस स्थान पर खड़ी थी। ",
      "officialWebsite": "https://www.dwarkadhishji.org/",
      "image": "dwarkadhish.png"
    },
    "liveUrl": "https://www.youtube.com/embed/iQ1_Hvwryx0"
  },
  {
    "id": 19,
    "name": "kasthbhanjanhanumanji",
    "live": true,
    "streamInfo": {
      "channelId": "UCI1r_MNxzyvUPHyTdWDe4NA",
      "title": "Live : Shree KasthBhanjandev Hanumanji Mandir Salangpur Live Darshan"
    },
    "aartiTimings": [
      "05:30",
      "06:30",
      "07:30",
      "18:15"
    ],
    "templeInfo": {
      "description": "The Shree Kashtabhanjan Dev Hanumanji Temple, is a temple located in Sarangpur, Gujarat and is part of the Vadtal Gadi of the Swaminarayan Sampradaya. This temple is among the most prominent sites of worship for Hanuman devotees, honoring him in the powerful form of Kashtabhanjan Dev, meaning the 'Crusher of Sorrows.' Shree Kashtabhanjandev was installed by Gopalanand Swami (a prominent paramhansa of Swaminarayan). Gopalanand Swami touched the murti with a rod and the murti came alive and moved. This story has become a charter for the healing ritual performed at this temple.[1] The idol of Hanuman here is a stout figure with a handlebar moustache, with Shani Dev in his feminine form under his foot and baring his teeth, standing among sculpted foliage full of fruit bearing monkey attendants.[2] The overall temple renovations were done many times by the Swaminarayan Sampradaya. In 1899, Kothari Gordhandas of Vadtal appointed Shastriji Maharaj (Shastri Yagnapurushdas), the founder of BAPS, to oversee the temple’s affairs. During his tenure, Shastriji Maharaj renovated the temple, constructed the adjacent bungalow, and acquired additional land to expand the complex, contributing significantly to its present form.[3] Govardhandas then appointed a new mahant of the temple of Sarangpur. Since, then the Vadtal Gadi has constructed additional improvements and buildings to the temple. Hariprakash Swami is an incumbent trustee. Adjacent to the main temple is a dedicated mandir honoring Swaminarayan, which houses numerous sacred relics associated with his life and teachings. This mandir serves as a place of reverence and reflection for devotees, offering a unique glimpse into Swaminarayan’s legacy through carefully preserved items that are integral to the faith's history.",
      "hi": "यह कष्टभंजन (दुखों को कुचलने वाले) के रूप में हनुमानजी को समर्पित है।मंदिर है जो गुजरात के सारंगपुर में स्थित है। यह स्वामीनारायण संप्रदाय की वड़ताल गढ़ी (लक्ष्मी नारायण देव गढ़ी) के अंतर्गत आता है। यह दो स्वामीनारायण मंदिरों में से एक है, जिसमें पूजा के प्राथमिक देवता के रूप में स्वामीनारायण या कृष्ण की मूर्तियाँ नहीं हैं, यह मंदिर मूल रूप से स्वामीनारायण संप्रदाय में सर्वाधिक प्रमुख है। गोपालानंद स्वामी ने हनुमान की मूर्ति स्थापित की थी। लेखक रेमंड विलियम्स के अनुसार, यह बताया गया है कि जब सद्गुरु गोपालानंद स्वामी ने हनुमान की मूर्ति को स्थापित किया, तो उन्होंने उसे एक छड़ी से छुआ और मूर्ति जीवित हो गई और चलायमान हो गई। यह कहानी इस मंदिर में किए जाने वाले उपचार अनुष्ठान के लिए घोषणापत्र बन गई है।[3] यहां हनुमान की मूर्ति की एक मजबूत आकृति निर्मित है, जो एक राक्षसी को अपने पैर के नीचे कुचल रही है और अपने दांतों को नोंच रही है।[1] 1899 में वड़ताल के कोठारी गोवर्धनदास ने मंदिर के मामलों के प्रबंधन के लिए श्री गोपालानंद स्वामी को नियुक्त किया; तथा अपने कार्यकाल के दौरान, शास्त्री यज्ञपुरुषदास ने इस स्थल का जीर्णोद्धार किया, परिसर के बगल में बंगले का निर्माण किया और परिसर को इसकी वर्तमान स्थिति में लाने के लिए अधिक से अधिक भूमि का अधिग्रहण किया।[4] यज्ञपुरुषदास ने फिर 1907 में इससे अलग होकर बोचासनवासी अक्षर पुरुषोत्तम स्वामिनारायण संस्था बनाया। गोवर्धनदास ने तब सारंगपुर के मंदिर का एक नया महंत नियुक्त किया। तब से वड़ताल गढ़ी ने मंदिर में अतिरिक्त सुधार और भवनों का निर्माण कार्य किया है। ",
      "officialWebsite": "https://salangpurhanumanji.org/",
      "image": "kasthbhanjanhanumanji.png"
    },
    "liveUrl": "https://www.youtube.com/embed/SOMWOTvJ6f8"
  },
  {
    "id": 20,
    "name": "govinddevji",
    "live": true,
    "streamInfo": {
      "channelId": "UCSCMDOZrz_4-1dtnXsp8M7Q",
      "title": "THIKANA MANDIR SHREE GOVIND DEVJI Live Darshan"
    },
    "aartiTimings": [
      "05:00",
      "07:45",
      "09:30",
      "10:45",
      "17:00",
      "17:45",
      "20:00"
    ],
    "templeInfo": {
      "description": "The historic Govind Dev Ji temple is situated in City Palace of Jaipur in Rajasthan, India. The temple is dedicated to Govind Dev (Krishna) and his consort Radha. The deities of the temple were brought from Vrindavan by Raja Sawai Jai Singh II, the founder of Jaipur. This Vaishnav temple is considered to be one of the most sacred and significant temple for devotees. According to the popular legend, the image of Govind Devji is also called 'Bajrakrit' because it was created by Bajranabh – The great-grandson of Krishna. Around 5,000 years ago when Bajranabh was around 13 years old, he asked his Grand mother (daughter-in-law of Krishna) as to how Krishna looked like. Then based on her description, he made three images. In first image, the feet show the resemblance with the Krishna's feet. In second image, chest area looked like Krishna's. In third image, the face showed complete resemblance with Krishna's face when he was incarnated on Earth. The first one image is known as Lord 'Madan Mohan ji'. The second image is called as 'Gopinath ji' and the third image is popular with the name of 'Govind Devji'. With the passing of ages, these pious divine images were also lost. Some 500 years ago, Vaishnava Acharya Sri Chaitanya Mahaprabhu asked one of his disciples Sri Rupa Goswami to excavate the divine icon of Govinda, which had been buried to protect it from the invaders.",
      "hi": "भगवान कृष्ण का जयपुर का सबसे प्रसिद्ध बिना शिखर का मंदिर। यह चन्द्र महल के पूर्व में बने जय निवास बगीचे के मध्य अहाते में स्थित है।[1] संरक्षक देवता गोविंदजी की मुर्ति पहले वृंदावन के मंदिर में स्थापित थी जिसको सवाई जय सिंह द्वितीय ने अपने परिवार के देवता के रूप में यहाँ पुनः स्थापित किया था। भगवान श्री कृष्ण के प्रपौत्र एवं मथुरा के राजा वज्रनाभ ने अपनी माता से सुने गए भगवान श्री कृष्ण के स्वरूप के आधार पर तीन विग्रहों का निर्माण करवाया इनमें से पहला विग्रह है गोविंद देव जी का है दूसरा विग्रह जयपुर के ही श्री गोपीनाथ जी का है तथा तीसरा विग्रह है श्री मदन मोहन जी करौली का है वजरनाभ के माता के अनुसार श्री गोविंद देव का मुख, श्री गोपीनाथ का वक्ष, श्री मदन मोहन के चरण श्री कृष्ण के स्वरूप से मेल खाते हैं पहले यह तीनों विग्रह मथुरा में स्थापित थे किंतु 11वीं शताब्दी ईस्वी के प्रारंभ में मोहम्मद गजनवी के आक्रमण के भय से इन्हें जंगल में छिपा दिया गया 16 वी शताब्दी में चैतन्य महाप्रभु के आदेश पर उनके शिष्यों ने इन विग्रहों को खोज निकाला और मथुरा वृंदावन में स्थापित कर दिया सन 1669 में जब औरंगजेब ने मथुरा के समस्त मंदिरों को नष्ट करने का आदेश दिया तो गौड़ीय संप्रदाय के पुजारी इन विग्रहों को उठाकर जयपुर भाग आए इन तीनों विग्रहों को जयपुर में ही स्थापित कर दिया गया गोविंद देव जी को जयपुर का शासक माना गया और वहां शासकीय मर्यादा लागू हुई, ",
      "officialWebsite": "https://mandirshrigovinddevjijaipur.org/",
      "image": "govinddevji.png"
    },
    "liveUrl": "https://www.youtube.com/embed/c7jtxJuC07c"
  },
  {
    "id": 21,
    "name": "baglamukhimataji",
    "live": true,
    "streamInfo": {
      "channelId": "UCjw3KKoDkZwuFWedwvezDEQ",
      "title": "Mabaglamukhi Nalkheda Live darshan chennal"
    },
    "aartiTimings": [
      "06:00",
      "19:30"
    ],
    "templeInfo": {
      "description": "The Bagalamukhi Temple, Nalkheda is located on the banks of the Lakhundar River, a tributary of the Narmada River, in Nalkheda, a town in the Agar Malwa district of Madhya Pradesh, India. It is dedicated to the goddess Bagalamukhi, a devi and one of the ten Mahavidyas. Mataji is associated with the colour yellow. The temple is a three-faced temple, with the goddess Bagalamukhi in the centre, flanked by the goddesses Lakshmi and Saraswati. The temple is also associated with the goddesses Krishna, Hanuman, and Bhairav. The temple is said to have been established by Yudhishthira, the eldest of the Pandavas, on the advice of Lord Krishna, to gain victory.",
      "hi": "मध्यप्रदेश में तीन मुखों वाली त्रिशक्ति माता बगलामुखी का यह मंदिर आगर जिले की तहसील नलखेड़ा में लखुंदर नदी के किनारे स्थित है। द्वापर युगीन यह मंदिर अत्यंत चमत्कारिक है। यहाँ देशभर से शैव और शाक्त मार्गी साधु-संत तांत्रिक अनुष्ठान के लिए आते रहते हैं। इस मंदिर में माता बगलामुखी के अतिरिक्त माता लक्ष्मी, कृष्ण, हनुमान, भैरव तथा सरस्वती भी विराजमान हैं। इस मंदिर की स्थापना महाभारत में विजय पाने के लिए भगवान कृष्ण के निर्देश पर महाराजा युधि‍ष्ठिर ने की थी। मान्यता यह भी है कि यहाँ की बगलामुखी प्रतिमा स्वयंभू है |",
      "officialWebsite": "http://mabaglamukhi.org/",
      "image": "baglamukhimataji.png"
    }
  },
  {
    "id": 4,
    "name": "omkareshwar",
    "live": false,
    "liveUrl": "https://www.youtube.com/embed/pC4232_RIXI",
    "fallbackUrl": "",
    "aartiTimings": [
      "04:30",
      "12:25",
      "20:00"
    ],
    "templeInfo": {
      "description": "There are two main temples of Shiva here, one to Omkareshwar (whose name means 'Lord of Omkara or the Lord of the Om sound') located in the island and one to Mamleshwar (Amaleshwar) (whose name means 'Immortal Lord' or 'lord of the Immortals or Devas') located on the southern bank of the Narmada River on the mainland. Madhya Pradesh has two Jyotirlingas, the second one, Mahakaleshwar Jyotirlinga, is situated about 140 km north of Omkareshwar Jyotirlinga. Omkareshwar temple in Mandhata is located on an pranva shaped (shape like “ॐ”) island at Narmada. Mamaleshwar (ancient name Amareshwar) temple is located on the south coast. Both the temples are described as equal status. Both of these Shivlingas are considered as Jyotirlingas. 75 kms from Khandwa On Indore-Khandwa Highway This is a very ancient holy place for Hindus. One of the 12 Jyotirlingas of Omkar-Mamaleswar and sidhdhawar kut of Jain are located in this place. Millions of devotees of both religion and foreigners visits the place every year. The cave of Govind ji, the Guru of Adiguru Shankaracharya (Philosopher of supreme theory of Advaita), ruins of the grand temple of Siddhnath, Temple of Gauri Somnath, and rinkmukteshwar Temple are situated at this place.",
      "hi": "नर्मदा नदी के मध्य ओमकार पर्वत पर स्थित ओंकारेश्वर ज्योतिर्लिंग मंदिर हिंदुओं की चरम आस्था का केंद्र है । ओम्कारेश्वर का यह शिव मंदिर भारत के 12 ज्योतिर्लिंगों में एक माना जाता है और यहां पर मां नर्मदा स्वयं ॐ के आकार में बहती है नर्मदा के उत्तरी तट पर ओंकार पर्वत पर जो कि एक द्वीप के रूप में ओमकारेश्वर अत्यंत ही पवित्र व सिद्ध स्थान है । हिंदुओं में सभी तीर्थों के दर्शन पश्चात ओंकारेश्वर के दर्शन व पूजन विशेष महत्व है । तीर्थ यात्री सभी तीर्थों का जल लाकर ओमकारेश्वर में अर्पित करते हैं, तभी सारे तीर्थ पूर्ण माने जाते हैं अन्यथा वे अधूरे ही माने जाते हैं | अनेक अन्य मंदिरों के साथ ममलेश्वर ज्योतिर्लिंग नर्मदा जी के दक्षिणी तट पर विराजमान है , द्वादश ज्योतिर्लिंग में भी उल्लेखित है इसका प्राचीन नाम अमरेश्वर महादेव है संभवत वर्षा ऋतु बाढ़ इत्यादि के समय जब ओम्कारेश्वर पहुंचना संभव ना होता होगा तब इसके दर्शन से ही धर्मावलंबी संतुष्ट होते होंगे | ",
      "officialWebsite": "https://shriomkareshwar.org/",
      "image": "omkareshwar.png"
    }
  },
  {
    "id": 6,
    "name": "bhimashankar",
    "live": false,
    "liveUrl": "https://www.youtube.com/embed/92EtGplwANI?amp;start=48",
    "aartiTimings": [
      "04:30",
      "15:00",
      "19:00"
    ],
    "templeInfo": {
      "description": "The Bhima River originates from the Bhimashankar village, and the hills of the Manmad village are present near it, there are old rock carvings of the God Bhimashankar, Bhootings and Amba-Ambika on these hills. The shrine is linked to the legendary asura known as Tripura. The story goes that Tripura did penance, and Brahma, delighted with Tripura's penance, manifests and grants him three wishes. Tripura demanded that he be invulnerable to the gods, devils, yakshas, and gandharvas. His three 'puras' should be unbreakable, and he should be able to travel anywhere in the universe. All his desires were fulfilled. Tripura embarked on a conquest to subjugate three Loka. Indra, the deity associated with the heavens, was also vanquished. Indra made the decision to seek blessings from the deity Shiva and performed penance. Shiva made a vow to annihilate Tripura. On the peak of the Sahyadri hills, it is said that Shiva assumed the form of 'Bhīmā Shankara' at the behest of the gods, and the sweat that spilled from his body after the battle is said to have formed the Bhimarathi river.",
      "hi": "भीमाशंकर मंदिर महाराष्ट्र के पुणे जिले में भीमाशंकर नामक गांव में स्थित भगवान शिव को समर्पित एक हिंदू मंदिर है । यह एक प्रमुख तीर्थस्थल है और इसमें 12 ज्योतिर्लिंगों में से एक है । मंदिर का शिवलिंग महाराष्ट्र के पाँच ज्योतिर्लिंगों में से एक है। यह मंदिर पुणे से 110 किलोमीटर दूर एक पहाड़ पर स्थित है। मंदिर के आसपास के क्षेत्र में दुर्लभ पौधे और पशु प्रजातियाँ हैं। यह मंदिर भीमाशंकर वन क्षेत्र में खेड़ तालुका में स्थित है । यह मंदिर त्रिपुरा नामक पौराणिक असुर से जुड़ा हुआ है । कहानी यह है कि त्रिपुरा ने तपस्या की और ब्रह्मा, त्रिपुरा की तपस्या से प्रसन्न होकर प्रकट हुए और उसे तीन इच्छाएँ प्रदान कीं। त्रिपुरा ने माँग की कि वह देवताओं, शैतानों, यक्षों और गंधर्वों के लिए अजेय हो । उसके तीन 'पुर' अटूट होने चाहिए और वह ब्रह्मांड में कहीं भी यात्रा करने में सक्षम होना चाहिए। उसकी सभी इच्छाएँ पूरी हुईं। त्रिपुरा ने तीन लोकों को अपने अधीन करने के लिए विजय अभियान शुरू किया । स्वर्ग से जुड़े देवता इंद्र भी पराजित हुए। इंद्र ने भगवान शिव से आशीर्वाद लेने का फैसला किया और तपस्या की। शिव ने त्रिपुरा का विनाश करने की प्रतिज्ञा की। ऐसा कहा जाता है कि सह्याद्रि पहाड़ियों की चोटी पर शिव ने देवताओं के आदेश पर 'भीम शंकर' का रूप धारण किया था, और युद्ध के बाद उनके शरीर से निकले पसीने से भीमरथी नदी बनी थी। ",
      "officialWebsite": "https://shreebhimashankar.com/en/",
      "image": "bhimashankar.png"
    }
  },
  {
    "id": 7,
    "name": "rameswaram",
    "live": false,
    "liveUrl": "https://www.youtube.com/embed/b4TKLXBHEyA?amp;start=23",
    "aartiTimings": [
      "05:00",
      "07:00",
      "10:00",
      "12:00",
      "18:00",
      "20:45"
    ],
    "templeInfo": {
      "description": "Ramanathaswamy Temple (Rāmanātasvāmi Kōyil) is a Hindu temple dedicated to the Hindu god Shiva located on Rameswaram island in the state of Tamil Nadu, India. Rama, the seventh avatar of the god Vishnu, prayed to Shiva here to absolve any sins that he might have committed during his war against the demon-king Ravana in Sri Lanka, who was a brahmin.[3] According to the Puranas[which?] (Hindu scriptures), upon the advice of sages, Rama along with his wife Sita and his brother Lakshmana, installed and worshipped the lingam[citation needed] (an iconic symbol of Shiva) here to expiate the sin of Brahmahatya incurred while killing Ravana (who was a Brahmin and son of Vishrava). To worship Shiva, Rama directed his trusted lieutenant Hanuman (avatar of Shiva himself) to bring it from Himalayas. Since it took longer to bring the lingam, Sita built a lingam made of sand from the nearby seashore, which is also believed to be the one in the sanctum of the temple. This account is well supported by the original Ramayana authored by Valmiki where it is written in Yudha Kanda.[where?] According to another version, as quoted in Adhyatma Ramayana, Rama installed the lingam before the construction of the bridge to Lanka. This version also finds reference in Valmiki Ramayana, where Sri Rama on his way back to Ayodhya, shows an Island to Sita from the Pushpaka Vimana, saying he received grace of MahaDeva at that place.",
      "hi": "रामेश्वरम हिंदुओं का एक पवित्र तीर्थ है। यह तमिलनाडु के रामनाथपुरम जिले में स्थित है। यह तीर्थ हिन्दुओं के चार धामों में से एक है। रामेश्वरम् के विख्यात मंदिर की स्थापना के बारें में यह रोचक कथाऐ कही जाती है। सीताजी को छुड़ाने के लिए राम ने लंका पर चढ़ाई की थी। उन्होने युद्ध के बिना सीताजी को छुड़वाने का बहुत प्रयत्न किया, पर जब रावण के न मानने पर विवश होकर उन्होने युद्ध किया। इस युद्ध हेतु राम को वानर सेना सहित सागर पार करना था, जो अत्यधिक कठिन कार्य था। तब श्री राम ने, युद्ध कार्य में सफलता ओर विजय के पश्र्चात कृतज्ञता हेतु उनके आराध्य भगवान शिव की आराधना के लिए समुद्र किनारे की रेत से शिवलिंग का अपने हाथों से निर्माण कीया, तभी भगवान शिव सव्यम् ज्योति स्वरुप प्रकट हुए ओर उन्होंने इस लिंग को श्री रामेश्वरम की उपमा दी। इस युद्ध में रावण के साथ, उसका पुरा राक्षस वंश समाप्त हो गया और अन्ततः सीताजी को मुक्त कराकर श्रीराम वापस लौटे।",
      "officialWebsite": "https://rameswaramramanathar.hrce.tn.gov.in/",
      "image": "rameswaram.png"
    }
  },
  {
    "id": 8,
    "name": "nageshwar",
    "live": false,
    "liveUrl": "https://www.youtube.com/embed/e1sTPDj1Bkw",
    "aartiTimings": [
      "05:00",
      "12:00",
      "20:30"
    ],
    "templeInfo": {
      "description": "Nageshwar Temple is a Hindu temple dedicated to the Hindu god Shiva located on Dwarka, Gujarat, India. one of the legendary temples mentioned in the Shiva Purana and is one of the twelve Jyotirlingas. Nageshvara jyotirlinga is situated in a forest called Daarukavanam In Gujarat, There was once a fierce demon Daruk inhabiting the forest with his wife Daruka. Due to a boon granted by Parvati, Daruk had become quite arrogant and stubborn. He along with his Daruka started interfering and destroying Hindu festivities. He even captured Supriya (a great devotee of Shiva) and many others and imprisoned them in a hidden dungeon. Supriya continued all Shiva Puja rites everyday and also wore the holy ash/ Bhasma daily besides donning Rudraksha and uttering the Om Namah Shivay Shiva Mantra. Lord Shiva was moved on seeing this unconditional trust and devotion and he appeared at the place. It was then that a divine Jyotirlinga got established there. Lord Shiva vanquished the demons and the place became famous as Darukavanam while Linga came to be known as Naganath. Another story dates back to the Pandava brothers in Dwapar Yuga. The strongest of the 5 brothers, Bhima saw a river full of cream and milk and he along with the rest of his brothers found a Swayambhu (self-manifested) Lingam in the middle of the river. This was the exact spot where the Nageshwar temple was built.",
      "hi": "श्री नागेश्वर ज्योतिर्लिंग का भगवन शिव के बारह ज्योतिर्लिंग में दसवां स्थान है। यह ज्योतिर्लिंग प्रमाणिक रूप से कहाँ स्थित है, यह विद्वानों के दावे - प्रतिदावे चलते रहने के कारण कहना आसान नहीं है, फिर भी गुजरात राज्य में गोमती द्वारका के बीच दारूकावन क्षेत्र में इसके प्रामाणिक स्थान होने की मान्यता अधिक है। पौराणिक कथा के अनुसार दारुका नाम की एक राक्षस कन्या थी, उसे दारुका वन में जाने की अनुमति नहीं थी. उसने कठिन तपस्या कर माता पार्वती को प्रसन्न कर लिया था. माता पार्वती ने दारुका से वरदान मांगने को कहा था तो राक्षसी ने वह दारुका वन में कई प्रकार की दैवीय औषधियां. उसने देवी पार्वती से सद्कर्मों के लिए राक्षसों को वन में जाने का वरदान मांगा. राक्षसी दारुका ने शिव भक्त को बनाया बंदी देवी पार्वती राक्षसी के विचारों से प्रसन्न हुई और उन्होंने उसे दारुका वन में जाने का वर दान दे दिया लेकिन वरदान मिलते ही दारुका और अन्य राक्षसों ने वन को देवताओं से छीन लिया. वन में एक सुप्रिया नाम की शिवभक्त थी जिसे दारुका ने बंदी बना लिया था. इसके बाद सुप्रिया ने शिव की तपस्या की और उनसे राक्षसों के नाश का वरदान मांगा. ऐसे हुई नागेश्वर ज्योतिर्लिंग की स्थापना सुप्रिया ने शिव जी की तपस्या करके राक्षसों से खुद का बचाव और उनका नाश की प्रार्थना की. अपनी परम भक्त की रक्षा के लिए भगवान शिव दिव्य ज्योति के रूप में एक बिल से प्रकट हुए. महादेव ने राक्षसों से विनाश कर दिया. सुप्रिया ने उस ज्योतिर्लिंग का विधिवत पूजन किया और शिवजी से इसी स्थान पर स्थित होने का आग्रह किया। भगवान शिव अपने भक्त का आग्रह मान कर वहीं स्थित हो गे. इस प्रकार ज्योतिर्लिंग स्वरूप भगवान शिव ‘नागेश्वर’ कहलाए.",
      "officialWebsite": "https://devbhumidwarka.nic.in/tourist-place/nageshwar-temple/",
      "image": "nageshwar.png"
    }
  },
  {
    "id": 10,
    "name": "trimbakeshwar",
    "liveUrl": "https://g2.ipcamlive.com/ea396b13-76c4-4504-8ab9-134daa0b3001",
    "aartiTimings": [
      "07:00",
      "10:45",
      "18:00"
    ],
    "templeInfo": {
      "description": "Trimbakeshwar Shiva Temple is an ancient Hindu temple in the town of Trimbak, in the Nashik District of Maharashtra, It is believed that Gautama Rishi lived on the Brahmagiri hills with his wife, Ahilya. There was a famine of 24 years; people were affected by the pangs of hunger. Daily in the morning, Gautama Rishi sows rice in the surrounding fields of his Ashram. Lord Varun (God of the rain), pleased with the sage of Gautama, arranged the rain everywhere in Gautama's Ashram, which was in Trimbakeshwar. Because of Gautama Rishi Steadfast devotion and regular prayers, God blessed him with abundant food grains. In the afternoon, he reaps the crop and fed it to a group of Rishis who took shelter in Gautama's Ashram on account of the famine. Because of all these Hrishis blessings, Gautam Rishi Punya or merit got increased. Lord Indras also get jealous due to raised position of Gautam Rishi. Lord Indra ordered clouds to rain all over the Trimbakeshwar, so that femine will over, Rishis will go back, and merits of Gautam Rishi will get weakened. Gautama requested all Rishis to stay back and kept on feeding them. The other Rishi also felt jealous of him and sent a cow to Gautam Rishi's field. When Gautam Rishi tried to frighten the Cow away from his fields, Cow died. It was Jaya- Goddess Paravati's friend, who had taken the form of Cow. Gautama worshipped Lord Shiva, requested him to release the Ganga river, and a bath in the Ganga River would set him free of his sins. Lord Shiva released Ganga and told her to stay there. The Kushavarta Pond that exists now in Godavari River, people worship the Godavari as Ganga. All Rishi's requested to Lord Shiva to stay there, which Lord Shiva did in the form of Trimbakeshwar Jyotirlinga.",
      "hi": "त्र्यम्बकेश्वर ज्योर्तिलिंग मन्दिर महाराष्ट्र-प्रांत के नासिक जिले में त्रयंबक गांव में हैं। यहां के निकटवर्ती ब्रह्म गिरि नामक पर्वत से गोदावरी नदी का उद्गम है।  प्राचीनकाल में त्र्यंबक गौतम ऋषि की तपोभूमि थी। अपने ऊपर लगे गोहत्या के पाप से मुक्ति पाने के लिए गौतम ऋषि ने कठोर तप कर शिव से गंगा को यहाँ अवतरित करने का वरदान माँगा। फलस्वरूप दक्षिण की गंगा अर्थात गोदावरी नदी का उद्गम हुआ। गोदावरी के उद्गम के साथ ही गौतम ऋषि के अनुनय-विनय के उपरांत शिवजी ने इस मंदिर में विराजमान होना स्वीकार कर लिया। तीन नेत्रों वाले शिवशंभु के यहाँ विराजमान होने के कारण इस जगह को त्र्यंबक (तीन नेत्रों वाले) कहा जाने लगा। उज्जैन और ओंकारेश्वर की ही तरह त्र्यंबकेश्वर महाराज को इस गाँव का राजा माना जाता है, इसलिए हर सोमवार को त्र्यंबकेश्वर के राजा अपनी प्रजा का हाल जानने के लिए नगर भ्रमण के लिए निकलते हैं।",
      "officialWebsite": "https://trimbakeshwartrust.com/",
      "image": "trimbakeshwar.png"
    }
  },
  {
    "id": 11,
    "name": "kedarnath",
    "live": false,
    "liveUrl": "https://www.youtube.com/embed/cxlIUOMUrS4?amp;start=114",
    "aartiTimings": [
      "04:00",
      "19:00"
    ],
    "templeInfo": {
      "description": "Kedarnath Temple is a Hindu temple, one of the twelve jyotirlinga of Shiva. The temple is located on the Garhwal Himalayan range near the Mandakini river, in the state of Uttarakhand, India. Due to extreme weather conditions, the temple is open to the general public only between the months of April (Akshaya Tritiya) and November (Kartik Purnima, the autumn full moon). There are several legends associated with the Kedarnath temple and its significance. Some of the most notable legends are: Legend of Pandavas: It is said that the Pandavas, the heroes of the Hindu epic, the Mahabharata, built the Kedarnath temple as a way to atone for their sins. According to the legend, Lord Shiva tried to evade the Pandavas by taking the form of a bull, but was finally cornered by the Pandavas at Kedarnath. Lord Shiva then disappeared into the ground, leaving only his hump on the surface. The temple is believed to be built on the spot where Lord Shiva disappeared into the ground. Legend of Nara and Narayana: It is believed that the sages Nara and Narayana meditated at Kedarnath for many years, and Lord Shiva was so pleased with their devotion that he granted them a permanent dwelling place at the temple. Legend of the Lingam: The lingam, a symbol of Lord Shiva, at the Kedarnath temple is said to have been formed naturally by the elements of earth, air, water, and fire. These legends and others have made Kedarnath a significant pilgrimage site for Hindus and a place of reverence for followers of Lord Shiva.",
      "hi": "केदारनाथ मन्दिर भारत के उत्तराखण्ड राज्य के रुद्रप्रयाग जिले में स्थित हिन्दुओं का प्रसिद्ध मंदिर है। उत्तराखण्ड में हिमालय पर्वत की गोद में केदारनाथ मन्दिर बारह ज्योतिर्लिंग में सम्मिलित होने के साथ चार धाम[क] और पंच केदार[ख] में से भी एक है। यहाँ की प्रतिकूल जलवायु के कारण यह मन्दिर अप्रैल से नवंबर माह के मध्‍य ही दर्शन के लिए खुलता है। पत्‍थरों से बने कत्यूरी शैली से बने इस मन्दिर के बारे में कहा जाता है कि इसका निर्माण पाण्डवों के पौत्र महाराजा जन्मेजय ने कराया था। यहाँ स्थित स्वयम्भू शिवलिंग अति प्राचीन है। आदि शंकराचार्य ने इस मन्दिर का जीर्णोद्धार करवाया। पंचकेदार की कथा ऐसी मानी जाती है कि महाभारत के युद्ध में विजयी होने पर पांडव भ्रातृहत्या के पाप से मुक्ति पाना चाहते थे। इसके लिए वे भगवान शंकर का आशीर्वाद पाना चाहते थे, लेकिन वे उन लोगों से रुष्ट थे। भगवान शंकर के दर्शन के लिए पांडव काशी गए, पर वे उन्हें वहां नहीं मिले। वे लोग उन्हें खोजते हुए हिमालय तक आ पहुंचे। भगवान शंकर पांडवों को दर्शन नहीं देना चाहते थे, इसलिए वे वहां से अंतध्र्यान हो कर केदार में जा बसे। दूसरी ओर, पांडव भी लगन के पक्के थे, वे उनका पीछा करते-करते केदार पहुंच ही गए। भगवान शंकर ने तब तक बैल का रूप धारण कर लिया और वे अन्य पशुओं में जा मिले। पांडवों को संदेह हो गया था। अत: भीम ने अपना विशाल रूप धारण कर दो पहाडों पर पैर फैला दिया। अन्य सब गाय-बैल तो निकल गए, पर शंकर जी रूपी बैल पैर के नीचे से जाने को तैयार नहीं हुए। भीम बलपूर्वक इस बैल पर झपटे, लेकिन बैल भूमि में अंतर्ध्यान होने लगा। तब भीम ने बैल की त्रिकोणात्मक पीठ का भाग पकड़ लिया। भगवान शंकर पांडवों की भक्ति, दृढ संकल्प देख कर प्रसन्न हो गए। उन्होंने तत्काल दर्शन देकर पांडवों को पाप मुक्त कर दिया। उसी समय से भगवान शंकर बैल की पीठ की आकृति-पिंड के रूप में श्री केदारनाथ में पूजे जाते हैं। ऐसा माना जाता है कि जब भगवान शंकर बैल के रूप में अंतर्ध्यान हुए, तो उनके धड़ से ऊपर का भाग काठमाण्डू में प्रकट हुआ। अब वहां पशुपतिनाथ का प्रसिद्ध मंदिर है। शिव की भुजाएं तुंगनाथ में, मुख रुद्रनाथ में, नाभि मद्महेश्वर में और जटा कल्पेश्वर में प्रकट हुए। इसलिए इन चार स्थानों सहित श्री केदारनाथ को पंचकेदार कहा जाता है। यहां शिवजी के भव्य मंदिर बने हुए हैं।",
      "officialWebsite": "https://badrinath-kedarnath.gov.in/",
      "image": "kedarnath.png"
    }
  },
  {
    "id": 12,
    "name": "grishneshwar",
    "live": false,
    "liveUrl": "https://www.youtube.com/embed/ef8UPbREvwY?amp;start=25",
    "aartiTimings": [
      "04:00",
      "19:30",
      "22:00"
    ],
    "templeInfo": {
      "description": "Grishneshwar Jyotirlinga is a Hindu temple, dedicated to Shiva in Verul village of Chhatrapati Sambhajinagar, India. It is one of the 12 Jyotirlinga mandirs. The mandir is a national protected site, one and a half kilometers away from the Ellora Caves, 30 kilometres (19 miles) north-west of the city Aurangabad, The word Ghrneshwara means 'lord of compassion' Long ago, in a celestial realm known as Kailash, Lord Shiva and his divine consort Parvati were residing. One day, a heated argument ensued between the two, leading to a wager. To settle the disagreement, Lord Shiva decided to test the devotion of humans on Earth. He declared that anyone who could travel around the world three times in a single day would be declared the winner. Parvati, concerned that this challenge would be impossible for humans to achieve, sought the assistance of Lord Vishnu. Lord Vishnu took the form of a young brahmin boy and approached Lord Shiva, asking for his help in completing the task. Lord Shiva, impressed by the boy’s devotion, granted him the ability to complete the challenge. As the brahmin boy was circumambulating the world, he came across a poor and elderly couple who were in distress. The couple was none other than the sage Gautama and his wife, Ahilya. They were caught in a terrible storm and were desperately seeking shelter. The brahmin boy, in his haste to complete the task, paid no attention to their pleas and continued his journey. Upon his return, Lord Shiva declared the brahmin boy the winner, and Parvati conceded defeat. However, Lord Vishnu, now in his true form, was overcome with guilt for not having helped the suffering couple. To atone for his neglect, he sought the sage Gautama and asked for forgiveness. In his deep remorse, Lord Vishnu decided to perform penance at the sacred site where the elderly couple had sought shelter. The intensity of his devotion created an immense heat, which eventually led to the emergence of a divine light. Lord Shiva, witnessing this, appeared before Lord Vishnu in the form of a jyotirlinga, a sacred symbol of his presence. This jyotirlinga, believed to be the Lord of Intense Heat or Grishneshwar, became the object of worship at the site. It was this jyotirlinga that the sage Gautama and his wife Ahilya had unwittingly been sheltering. Grishneshwar Temple was subsequently constructed to house this sacred manifestation of Lord Shiva.",
      "hi": "महाराष्ट्र में छ. संभाजी महाराज नगर के नजदीक दौलताबाद से 11 किलोमीटर दूर घृष्‍णेश्‍वर महादेव का मंदिर स्थित है। यह बारह ज्योतिर्लिंगों में से एक है। कुछ लोग इसे घुश्मेश्वर के नाम से भी पुकारते हैं। बौद्ध भिक्षुओं द्वारा निर्मित एलोरा की प्रसिद्ध गुफाएँ इस मंदिर के समीप ही स्थित हैं। इस मंदिर का निर्माण देवी अहिल्याबाई होल्कर ने करवाया था। शहर से दूर स्थित यह मंदिर सादगी से परिपूर्ण है। द्वादश ज्योतिर्लिंगों में यह अंतिम ज्योतिर्लिंग है। इस ज्योतिर्लिंग के विषय में पुराणों में यह कथा वर्णित है- दक्षिण देश में देवगिरिपर्वत के निकट सुधर्मा नामक एक अत्यंत तेजस्वी तपोनिष्ट ब्राह्मण रहता था। उसकी पत्नी का नाम सुदेहा था दोनों में परस्पर बहुत प्रेम था। किसी प्रकार का कोई कष्ट उन्हें नहीं था। लेकिन उन्हें कोई संतान नहीं थी। ज्योतिष-गणना से पता चला कि सुदेहा के गर्भ से संतानोत्पत्ति हो ही नहीं सकती। सुदेहा संतान की बहुत ही इच्छुक थी। उसने सुधर्मा से अपनी छोटी बहन से दूसरा विवाह करने का आग्रह किया। पहले तो सुधर्मा को यह बात नहीं जँची। लेकिन अंत में उन्हें पत्नी की जिद के आगे झुकना ही पड़ा। वे उसका आग्रह टाल नहीं पाए। वे अपनी पत्नी की छोटी बहन घुश्मा को ब्याह कर घर ले आए। घुश्मा अत्यंत विनीत और सदाचारिणी स्त्री थी। वह भगवान्‌ शिव की अनन्य भक्ता थी। प्रतिदिन एक सौ एक पार्थिव शिवलिंग बनाकर हृदय की सच्ची निष्ठा के साथ उनका पूजन करती थी। भगवान शिवजी की कृपा से थोड़े ही दिन बाद उसके गर्भ से अत्यंत सुंदर और स्वस्थ बालक ने जन्म लिया। बच्चे के जन्म से सुदेहा और घुश्मा दोनों के ही आनंद का पार न रहा। दोनों के दिन बड़े आराम से बीत रहे थे। लेकिन न जाने कैसे थोड़े ही दिनों बाद सुदेहा के मन में एक कुविचार ने जन्म ले लिया। वह सोचने लगी, मेरा तो इस घर में कुछ है नहीं। सब कुछ घुश्मा का है। अब तक सुदेहा के मन का कुविचार रूपी अंकुर एक विशाल वृक्ष का रूप ले चुका था। मेरे पति पर भी उसने अधिकार जमा लिया। संतान भी उसी की है। यह कुविचार धीरे-धीरे उसके मन में बढ़ने लगा। इधर घुश्मा का वह बालक भी बड़ा हो रहा था। धीरे-धीरे वह जवान हो गया। उसका विवाह भी हो गया। अंततः एक दिन सुदेहा ने घुश्मा के युवा पुत्र को रात में सोते समय मार डाला। उसके शव को ले जाकर उसने उसी तालाब में फेंक दिया जिसमें घुश्मा प्रतिदिन पार्थिव शिवलिंगों को विसर्जित करती थी। सुबह होते ही सबको इस बात का पता लगा। पूरे घर में कुहराम मच गया। सुधर्मा और उसकी पुत्रवधू दोनों सिर पीटकर फूट-फूटकर रोने लगे। लेकिन घुश्मा नित्य की भाँति भगवान्‌ शिव की आराधना में तल्लीन रही। जैसे कुछ हुआ ही न हो। पूजा समाप्त करने के बाद वह पार्थिव शिवलिंगों को तालाब में छोड़ने के लिए चल पड़ी। जब वह तालाब से लौटने लगी उसी समय उसका प्यारा लाल तालाब के भीतर से निकलकर आता हुआ दिखलाई पड़ा। वह सदा की भाँति आकर घुश्मा के चरणों पर गिर पड़ा। जैसे कहीं आस-पास से ही घूमकर आ रहा हो। इसी समय भगवान्‌ शिव भी वहाँ प्रकट होकर घुश्मा से वर माँगने को कहने लगे। वह सुदेहा की घनौनी करतूत से अत्यंत क्रुद्ध हो उठे थे। अपने त्रिशूल द्वारा उसका गला काटने को उद्यत दिखलाई दे रहे थे। घुश्मा ने हाथ जोड़कर भगवान्‌ शिव से कहा- 'प्रभो! यदि आप मुझ पर प्रसन्न हैं तो मेरी उस अभागिन बहन को क्षमा कर दें। निश्चित ही उसने अत्यंत जघन्य पाप किया है किंतु आपकी दया से मुझे मेरा पुत्र वापस मिल गया। अब आप उसे क्षमा करें और प्रभो! मेरी एक प्रार्थना और है, लोक-कल्याण के लिए आप इस स्थान पर सर्वदा के लिए निवास करें।' भगवान्‌ शिव ने उसकी ये दोनों बातें स्वीकार कर लीं। ज्योतिर्लिंग के रूप में प्रकट होकर वह वहीं निवास करने लगे। सती शिवभक्त घुश्मा के आराध्य होने के कारण वे यहाँ घुश्मेश्वर महादेव के नाम से विख्यात हुए। घुश्मेश्वर-ज्योतिर्लिंग की महिमा पुराणों में बहुत विस्तार से वर्णित की गई है। इनका दर्शन लोक-परलोक दोनों के लिए अमोघ फलदाई है।",
      "officialWebsite": "https://ghrishneshwar.com/",
      "image": "grishneshwar.png"
    }
  },
  {
    "id": 14,
    "name": "jagannath",
    "live": true,
    "streamInfo": {
      "channelId": "UCET-LB-LgAuDS-Cy8nfH4-w",
      "title": "Today's Mangala Alati Darshana"
    },
    "aartiTimings": [
      "05:00",
      "06:00",
      "07:00",
      "10:00",
      "13:00",
      "17:30",
      "19:30",
      "24:00"
    ],
    "templeInfo": {
      "description": "The Jagannath Temple is a Hindu temple dedicated to the god Jagannath, a form of Vishnu in Hinduism and two of his siblings, Balaram and Subhadra, alongside Sudarshan (the deified form of Vishnu's primary weapon). It is located in Puri in the state of Odisha, situated on the eastern coast of India. According to legends in Madala Panji, the construction of the first Jagannath temple was commissioned by King Indradyumna, a Malava king, mentioned in the Mahabharata and the Puranas.Indradyumna put up for Jagannath to build the tallest monument in the world. It was 1,000 cubits (457.2 metres) high. He invited Brahma, the cosmic creator, consecrate the temple and the images.The traditional story concerning the origins of the Jagannath temple is that the original image of Jagannath at the end of the Dvapara Yuga, was manifested near a banyan tree, near the shore in the form of an Indranila Mani, or the Blue Jewel. It was so dazzling that it could grant an instant moksha, so the god Dharma, wanted to hide it in the earth, and was successful. In the Kali Yuga, Indradyumna wanted to find that mysterious image, and to do so, he performed harsh penance to obtain his goal. Vishnu then instructed him to go to the seashore of Puri, and find a floating log to make an image from its trunk. Then, Indradyumna found the log of wood. He did a yajna, from which Narasimha appeared and instructed that Narayana should be made as a four-fold expansion, i.e., Paramatma as Vasudeva (Krishna), his Vyuha as Samkarshana (Balabhadra), his Yogamaya as Subhadra, and his Vibhava as Sudarshana. After this, Vishwakarma appeared in the form of an artisan and prepared images of Jagannath, Balabadra and Subhadra from the tree. When this log, radiant with light, was seen floating in the sea, Narada told the king to make three deities out of it and place them in a pavilion. Indradyumna got Vishwakarma, the architect of gods, to build a magnificent temple to house the deities, and Vishnu himself appeared in the guise of a carpenter to make the deities, on condition that he was to be left undisturbed until he finished the work. But just after two weeks, the queen of Indradyumna became very anxious. She took the carpenter to be dead as no sound came from the temple. Therefore, she requested the king to open the door. Thus, they went to see Vishnu at work, at which the latter abandoned his work, leaving the deities unfinished. The deity was devoid of any hands. But a divine voice told Indradyumna to install them in the temple. It has also been widely believed that in spite of the deity being without hands, it can watch over the world and be its lord. Thus, the idiom.",
      "hi": "मध्य भारत में मालवा नामक राज्य पर राजा इन्द्रद्युम्न का शासन हुआ करता था। राजा इन्द्रद्युम्न भगवान विष्णु के बहुत बड़े उपासक और भक्त थे। भगवान के प्रति अपनी अपार आस्था के चलते राजा के मन में हमेशा भगवान नारायण के दर्शन करने की इच्छा रहती थी। एक दिन उनके राज्य में एक बड़े ज्ञानी ऋषि आए और उनसे कहने लगे कि- हे राजन! क्या आपको सबर कबीले द्वारा पूजे जाने वाले भगवान विष्णु के दिव्य रूप नीलमाधव के विषय में कोई जानकारी है? इस बात को सुनकर राजा बोले- हे ब्राह्मण देव, मैं तो अज्ञानी हूं, मुझे कृपा करके बताइए कि मेरे आराध्य के इस दिव्य रूप की पूजा कहां की जाती है और मैं किस प्रकार से उनके दर्शन कर सकता हूं? राजा की बात का उत्तर देते हुए ऋषि बोले कि मुझे भी उस स्थान का ज्ञान नहीं है, इसलिए मैं आपकी सहायता मांगने आया था। लेकिन लगता है भगवान नीलमाधव के दर्शन करने की मेरी खोज अभी जारी रहेगी। अगर आप इसे ढूंढ़ने में मेरी सहायता कर पाएं तो अवश्य करें, मैं आपसे अब विदा लेता हूं। ऐसा कहकर ब्राह्मण देवता वहां से चले गए। वहीं दूसरी ओर राजा के मन में भी भगवान विष्णु के इस दिव्य अवतार के दर्शन की जिज्ञासा और भी प्रबल हो गई और उन्होंने अपने मुख्य पुजारी विद्यापति को बुलाकर यह आदेश दिया कि वह उस स्थान का पता लगाएं जहां भगवान विष्णु के दिव्य रूप नीलमाधव रूप की पूजा होती है। विद्यापति उस मंदिर की खोज में निकल पड़े, कुछ दिनों की यात्रा के बाद जब वह उस स्थान पर पहुंचे तो उन्हें गुप्तचरों से पता चला कि सबर कबीले के मुखिया, विश्ववासु ही नीलमाधव की पूजा करते हैं, ये सुनकर विद्यापति मुखिया के पास पहुंचे और उनसे विनती की कि वे उन्हें भगवान नीलमाधव के दर्शन करवाएं। लेकिन विश्ववासु ने उनको वहां ले जाने से मना कर दिया। यह सुनकर विद्यापति ने यह दृढ़ संकल्प लिया कि वह नीलमाधव के दर्शन किए बिना वहां से नहीं जाएंगे। कुछ समय पश्चात उन्हें यह ज्ञान हो गया कि विश्ववासु ही भगवान नील माधव का उपासक है और उसने भगवान जी की मूर्ति को किसी गुफा में छिपा रखा है। लेकिन कई बार प्रयत्न करने के बाद भी विद्यापति उस स्थान का पता नहीं लगा पाए। उस स्थान पर रहते-रहते, विद्यापति को कबीले के मुखिया विश्ववासु की बेटी से प्रेम हो गया और कबीले के मुखिया ने अपनी बेटी का विवाह विद्यापति के साथ कर दिया। इस प्रकार विद्यापति ने वहां कुछ और समय व्यतीत किया। एक दिन विद्यापति ने अपनी पत्नी से कहा कि वे अपने पिता से उन्हें भगवान नीलमाधव के दर्शन करवाने का आग्रह करें। अपने पति की इच्छा को पूर्ण करने के लिए विश्वावसु की बेटी ने उनसे प्रार्थना करते हुए विद्यापति को भगवान नीलमाधव के दर्शन करवाने के लिए कहा। आखिरकार विश्ववासु को अपनी बेटी के अनुरोध के आगे झुकना पड़ा और वे विद्यापति को भगवान विष्णु के दिव्य दर्शन करवाने के लिए मान गए । परंतु उन्होंने यह शर्त रखी की विद्यापति को अपनी आंखों पर पट्टी बांधनी होगी तभी वो उन्हें उस मंदिर के दर्शन करवाने के लिए ले जाएंगे। विद्यापति ने उनकी शर्त मान ली और अगले दिन विश्ववासु, विद्यापति की आंखों पर पट्टी बांधकर, उसे उस स्थान पर ले गए जहां भगवान नीलमाधव की पूजा अर्चना की जाती है। विद्यापति ने भी चतुराई दिखाते हुए सरसों के दानों को अपनी जेब में रख लिया। रास्ते को याद रखने के लिए वह उन दानों को रास्ते पर गिराता रहा। आखिरकार गुफा में पहुंचकर विद्यापति को भगवान नीलमाधव के दिव्य दर्शन करने का सौभाग्य प्राप्त हुआ। विद्यापति द्वारा गिराए गए दानों में से कुछ दिनों बाद सरसों के पौधे उग गए और वह राजा को लेकर उन पौधों का पीछा करते-करते दोबारा उस गुफा तक पहुंच गया। लेकिन जब वह दोनों वहां पहुंचे तो गुफा से भगवान नीलमाधव की मूर्ति गायब हो चुकी थी। राजा को बिना दर्शन के वापिस लौटना पड़ा, परंतु भगवान ने उन्हें उस दिन स्वप्न में दर्शन दिए और कहा कि मैं तुम्हारे पास लौटकर आऊँगा, समुद्र में लकड़ी का एक टुकड़ा तैर रहा है, तुम उसे उठा लाओ और उससे मेरी मूर्ति बनाकर एक मंदिर में स्थापित कर दो। राजा ने एक भव्य मंदिर का निर्माण करवाया और अपने सेवकों को समुद्र से इस लकड़ी के टुकड़े को लाने का आदेश दिया। परंतु जब उनके कई सेवक मिलकर भी उस लकड़ी को नहीं निकाल पाए तब राजा ने कबीले के मुखिया विश्ववासु को बुलाया। विश्ववासु ने अकेले ही उस टुकड़े को समुद्र से निकाल दिया। ये नजारा देख वहां मौजूद सभी लोग आश्चर्यचकित हो गए। इसके बाद जब लकड़ी से मूर्ति बनाने का कार्य शुरू हुआ तो राजा का कोई भी कुशल कारीगर उस लकड़ी को काट ही नहीं पाया। इस समस्या का समाधान करने के लिए स्वयं भगवान विश्वकर्मा वहां एक बूढ़े कारीगर का रूप धारण कर प्रकट हुए। और उन्होंने कहा कि- मैं भगवान नीलमाधव की मूर्ति का निर्माण 21 दिनों में करूंगा, परंतु मेरी यह शर्त है कि उस दौरान कोई भी मेरे कमरे के अंदर नहीं आएगा। राजा ने उनकी शर्त मान ली और भगवान विश्वकर्मा ने मूर्ति का निर्माण कार्य आरंभ कर दिया। कुछ दिनों तक तो कमरे के अंदर से आवाजें आती रहीं। लेकिन फिर कुछ समय पश्चात कमरे से आवाज़ आना बंद हो गई। यह देखकर राजा की पत्नी गुंडिचा खुद को नहीं रोक पाई। वो ये सोचने लगी कि कहीं उस वृद्ध व्यक्ति को कुछ हो तो नहीं गया। अपनी इस सोच पर उसने दरवाज़ा खोल दिया। शर्त के विरुद्ध दरवाजा खोलने से भगवान विश्वकर्मा वहां से अंतर्ध्यान हो गए। लेकिन वहां पर भगवान जगन्नाथ के साथ सुभद्रा और बलभद्र जी की अधूरी मूर्ति विराजमान थी। राजा को यह देखकर पश्चाताप हुआ। लेकिन उन्होंने इसे ही भगवान की इच्छा समझ कर उन प्रतिमाओं को मंदिर में स्थापित करवा दिया।",
      "officialWebsite": "https://www.shreejagannatha.in/",
      "image": "jagannath.png"
    },
    "liveUrl": "https://www.youtube.com/embed/XYwtiyQL43w"
  }
]